Bwooce/ardupilot/libraries/AP_HAL_ESP32/CANIface.cpp
    return true;
}

int16_t CANIface::send(const AP_HAL::CANFrame &frame, uint64_t tx_deadline, AP_HAL::CANIface::CanIOFlags flags)
{
    if (!initialized) {
        return -1;
    }


    CanTxItem tx_item;
    tx_item.frame = frame;
    tx_item.deadline_us = tx_deadline;
    tx_item.flags = flags;

    if (xQueueSendToBack(tx_queue, &tx_item, 0) != pdPASS) {
        return 0;
    }

    return 1;
}

int16_t CANIface::receive(AP_HAL::CANFrame &frame, uint64_t &timestamp_us, AP_HAL::CANIface::CanIOFlags &flags)
{
    if (!initialized) {
        return -1;
    }

    CanRxItem rx_item;
    if (xQueueReceive(rx_queue, &rx_item, 0) != pdPASS) {
        return 0;
    }

    frame = rx_item.frame;
    timestamp_us = rx_item.timestamp_us;
    flags = rx_item.flags;

    return 1;
}

bool CANIface::add_to_rx_queue(const CanRxItem &rx_item)
{
    return xQueueSendToBack(rx_queue, &rx_item, 0) == pdPASS;
}

void CANIface::rx_task(void *arg)
{
    CANIface *iface = (CANIface *)arg;

    // Register this task with watchdog
    ESP32::Scheduler::register_task_with_watchdog("can_rx");

    CAN_DEBUG_INFO("CAN RX task started for interface %d", iface->instance);

    while (true) {
        // Check if restart is in progress
        if (iface->restart_in_progress) {
            // During restart, just wait without trying to receive
            // Reset watchdog during the wait to prevent timeout
            esp_task_wdt_reset();
            vTaskDelay(pdMS_TO_TICKS(100));
            continue;
        }

        twai_message_t message;
        // Try to receive with zero timeout first to drain any waiting messages
        // If no messages, then wait with 1ms timeout
        esp_err_t rx_result = twai_receive(&message, 0);

        // If no message available immediately, wait a bit
        if (rx_result == ESP_ERR_TIMEOUT) {
            rx_result = twai_receive(&message, pdMS_TO_TICKS(1));
        }

        // Reset watchdog periodically, not on every iteration
        static uint32_t last_wdt_reset = 0;
        uint32_t now = xTaskGetTickCount();
        if (now - last_wdt_reset > pdMS_TO_TICKS(100)) {
            esp_task_wdt_reset();
            last_wdt_reset = now;
        }

        // Check again if restart happened while we were blocked in receive
        if (iface->restart_in_progress) {
            // Discard any received message and wait for restart to complete
            vTaskDelay(pdMS_TO_TICKS(100));
            continue;
        }


#if CONFIG_HAL_BOARD == HAL_BOARD_ESP32
        // Check what TWAI received for GetNodeInfo responses
        if (rx_result == ESP_OK && (message.flags & TWAI_MSG_FLAG_EXTD)) {
            // Check if this looks like a GetNodeInfo response (service type 1)
            if ((message.identifier & 0xFF80) == 0x0180) { // Service frame, type 1
                bool is_response = ((message.identifier >> 15) & 1) == 0;
                if (is_response) {
                    uint8_t dest = (message.identifier >> 8) & 0x7F;
                    uint8_t src = message.identifier & 0x7F;
                    static uint32_t rx_resp_count = 0;
                    rx_resp_count++;
                    if (rx_resp_count <= 20) {
                        ESP_LOGI("TWAI_RX", "Received GetNodeInfo response #%lu: TWAI ID=0x%08lX",
                                 (unsigned long)rx_resp_count, (unsigned long)message.identifier);
                        ESP_LOGI("TWAI_RX", "  From node %d to node %d",
                                 src, dest);

                        // Log first few data bytes
                        if (message.data_length_code >= 4) {
                            ESP_LOGI("TWAI_RX", "  Data: %02X %02X %02X %02X ... %02X",
                                     message.data[0], message.data[1], message.data[2], message.data[3],
                                     message.data[message.data_length_code - 1]);
                        }
                    }
                }
            }
        }
#endif

        if (rx_result != ESP_OK) {
            // Handle RX errors with enhanced detection
            if (rx_result == ESP_ERR_TIMEOUT) {
                // Normal timeout - no action needed
                continue;
            } else if (rx_result == ESP_FAIL) {
                // RX failure - update stats without logging in hot path
                iface->update_error_stats(0x03); // RX fail error
            } else {
                // Other RX errors - just update stats
                iface->update_error_stats(rx_result);
            }
            continue;
        }

#if CAN_LOGLEVEL >= 4
        // Verbose frame-by-frame logging - use ESP-IDF VERBOSE level
        static uint32_t rx_count = 0;
        rx_count++;
        
        char data_str[32] = {0};
        for (int i = 0; i < message.data_length_code && i < 8; i++) {
            snprintf(data_str + (i * 3), sizeof(data_str) - (i * 3), "%02X ", message.data[i]);
        }
        
        CAN_DEBUG_VERBOSE("RX #%lu: ID=0x%08X DLC=%d DATA=[%s]", 
                         (unsigned long)rx_count, (unsigned)message.identifier, 
                         message.data_length_code, data_str);
#elif CAN_LOGLEVEL >= 3
        // INFO level - summary every 1000 frames
        static uint32_t rx_count_summary = 0;
        rx_count_summary++;
        if ((rx_count_summary % 1000) == 0) {
            CAN_DEBUG_DEBUG("Received %lu frames, latest ID=0x%08X",
                            (unsigned long)rx_count_summary, (unsigned)message.identifier);
        }
#elif CAN_LOGLEVEL >= 2
        // WARN level - summary disabled (use CAN stats via MAVLink instead)
#endif

        CanRxItem rx_item;
        rx_item.timestamp_us = AP_HAL::micros64();
        rx_item.frame.id = message.identifier;
        if (message.extd) {
            rx_item.frame.id |= AP_HAL::CANFrame::FlagEFF;  // Set extended frame flag
        }
        rx_item.frame.dlc = message.data_length_code;
        memcpy(rx_item.frame.data, message.data, message.data_length_code);
        rx_item.flags = 0;
        
