Bwooce/ardupilot/libraries/AP_HAL_ESP32/CANIface.cpp
        // Single transmission attempt for DroneCAN compliance
        // DroneCAN handles reliability at protocol layer, HAL retries violate timing assumptions
        const TickType_t timeout_ms = 10; // Allow sufficient time for transmission

#if CONFIG_HAL_BOARD == HAL_BOARD_ESP32
        // Check if this is a GetNodeInfo response and log what we're sending
        if ((message.flags & TWAI_MSG_FLAG_EXTD) &&
            ((message.identifier & 0xFF80) == 0x0180)) { // Service frame, type 1
            bool is_response = ((message.identifier >> 15) & 1) == 0;
            if (is_response) {
                uint8_t dest = (message.identifier >> 8) & 0x7F;
                uint8_t src = message.identifier & 0x7F;
                static uint32_t resp_count = 0;
                resp_count++;
                if (resp_count <= 20) {
                    ESP_LOGI("TWAI_TX", "Sending GetNodeInfo response #%lu: CAN ID=0x%08lX",
                             (unsigned long)resp_count, (unsigned long)message.identifier);
                    ESP_LOGI("TWAI_TX", "  From node %d to node %d", src, dest);

                    // Log the actual bytes being sent to TWAI
                    ESP_LOGI("TWAI_TX", "  TWAI msg: id=0x%08lX, flags=0x%02X, dlc=%d",
                             (unsigned long)message.identifier, message.flags, message.data_length_code);
                }
            }
        }
#endif

        // Special debug for GetNodeInfo responses
#if CONFIG_HAL_BOARD == HAL_BOARD_ESP32
        if ((message.identifier & 0xFF80) == 0x0180 && ((message.identifier >> 15) & 1) == 0) {
            uint8_t dest_before = (message.identifier >> 8) & 0x7F;
            ESP_LOGW("TWAI_BUG", "About to transmit GetNodeInfo response to node %d, ID=0x%08lX",
                     dest_before, (unsigned long)message.identifier);
        }
#endif

        esp_err_t result = twai_transmit(&message, pdMS_TO_TICKS(timeout_ms));

#if CONFIG_HAL_BOARD == HAL_BOARD_ESP32
        if ((message.identifier & 0xFF80) == 0x0180 && ((message.identifier >> 15) & 1) == 0) {
            uint8_t dest_after = (message.identifier >> 8) & 0x7F;
            ESP_LOGW("TWAI_BUG", "After transmit GetNodeInfo response: dest=%d, result=%d",
                     dest_after, result);
            // Check if TWAI modified the message
            if (dest_after != ((message.identifier >> 8) & 0x7F)) {
                ESP_LOGE("TWAI_BUG", "TWAI MODIFIED THE CAN ID DURING TRANSMISSION!");
            }
        }
#endif

#if CAN_LOGLEVEL >= 2
        // Periodic error counter monitoring - check regardless of TX result to catch failures
        // Only enabled at CAN_LOGLEVEL >= 2 to reduce log verbosity
        static uint32_t last_health_check_ms = 0;
        static uint32_t last_tx_err = 0;
        static uint32_t last_rx_err = 0;
        uint32_t now_ms = AP_HAL::millis();

        if (now_ms - last_health_check_ms >= 1000) {  // Check every 1 second for faster detection
            twai_status_info_t health_status;
            if (twai_get_status_info(&health_status) == ESP_OK) {
                int32_t tx_delta = (int32_t)health_status.tx_error_counter - (int32_t)last_tx_err;
                int32_t rx_delta = (int32_t)health_status.rx_error_counter - (int32_t)last_rx_err;

                // Log at key thresholds or every 5 seconds when healthy
                bool should_log = false;
                const char* reason = "";

                if (health_status.tx_error_counter > 0 && last_tx_err == 0) {
                    should_log = true;
                    reason = " [FIRST ERROR]";
                } else if (health_status.tx_error_counter >= 96 && last_tx_err < 96) {
                    should_log = true;
                    reason = " [WARNING: approaching bus-off at 128]";
                } else if (health_status.tx_error_counter >= 128) {
                    should_log = true;
                    reason = " [BUS-OFF THRESHOLD]";
                } else if ((now_ms / 1000) % 5 == 0 && (now_ms - last_health_check_ms) < 2000) {
                    // Log every 5 seconds when healthy (check time delta to avoid duplicate logs)
                    should_log = true;
                    reason = "";
                }

                if (should_log) {
                    ESP_LOGI("CAN_HEALTH", "T+%lus: TX_ERR=%u (%+ld), RX_ERR=%u (%+ld), state=%d%s",
                             (unsigned long)(now_ms / 1000),
                             health_status.tx_error_counter, (long)tx_delta,
                             health_status.rx_error_counter, (long)rx_delta,
                             health_status.state, reason);
                }

                last_tx_err = health_status.tx_error_counter;
                last_rx_err = health_status.rx_error_counter;
            }
            last_health_check_ms = now_ms;
        }
#endif // CAN_LOGLEVEL >= 2

        if (result == ESP_OK) {
            // Track for self-reception filtering
            iface->tx_tracker[iface->tx_tracker_index].can_id = message.identifier;
            iface->tx_tracker[iface->tx_tracker_index].timestamp_us = AP_HAL::micros64();
            iface->tx_tracker[iface->tx_tracker_index].loopback_requested = (tx_item.flags & AP_HAL::CANIface::Loopback) != 0;
            iface->tx_tracker_index = (iface->tx_tracker_index + 1) % TX_TRACKER_SIZE;
        }
        
        // Update statistics and handle errors
        iface->update_tx_stats(result == ESP_OK);
        
        if (result != ESP_OK) {
            // Handle specific TWAI error conditions
            if (result == ESP_ERR_TIMEOUT) {
                // TX timeout - bus may be congested or disconnected
                // Count timeouts but don't log them - stats are tracked elsewhere
                static uint32_t timeout_count = 0;
                timeout_count++;
                // Disabled - CAN stats are available via MAVLink
                // Only enable for debugging CAN issues
#if 0
                if (timeout_count <= 5 || (timeout_count % 1000) == 0) {
                    CAN_DEBUG_WARN("TX timeout on message ID=0x%08X (total timeouts=%lu)",
                                   (unsigned)(tx_item.frame.id & AP_HAL::CANFrame::MaskExtID),
                                   (unsigned long)timeout_count);
                }
#endif
            } else if (result == ESP_FAIL) {
                // TX failed - check bus state and log error counters
                twai_status_info_t twai_status;
                if (twai_get_status_info(&twai_status) == ESP_OK) {
                    // Track error counter progression
                    static uint32_t last_tx_err = 0;
                    static uint32_t last_rx_err = 0;
                    static uint32_t last_fail_log_ms = 0;
                    uint32_t now_ms = AP_HAL::millis();

                    uint32_t tx_delta = (twai_status.tx_error_counter > last_tx_err) ?
                                       (twai_status.tx_error_counter - last_tx_err) : 0;
                    uint32_t rx_delta = (twai_status.rx_error_counter > last_rx_err) ?
                                       (twai_status.rx_error_counter - last_rx_err) : 0;

