Bwooce/ardupilot/libraries/AP_HAL_ESP32/CANIface.cpp
                    if (twai_status.state == TWAI_STATE_BUS_OFF) {
                        // Bus-off condition detected - use rate-limited logging
                        ESP_LOGE("CAN", "TX failed led to BUS_OFF: TX_ERR=%u (+%lu), RX_ERR=%u (+%lu)",
                                 twai_status.tx_error_counter, (unsigned long)tx_delta,
                                 twai_status.rx_error_counter, (unsigned long)rx_delta);
                        iface->log_bus_state(BusState::BUS_OFF);
                        iface->update_error_stats(0x01); // Bus-off error code

                        // Attempt bus recovery
                        ESP_LOGI("CAN", "Initiating recovery from BUS_OFF (software-triggered)");
                        twai_initiate_recovery();
                    } else if (now_ms - last_fail_log_ms > 1000) {
                        // Log error counter progression every second
                        ESP_LOGW("CAN", "TX failures accumulating: TX_ERR=%u (+%lu), RX_ERR=%u (+%lu), state=%d",
                                 twai_status.tx_error_counter, (unsigned long)tx_delta,
                                 twai_status.rx_error_counter, (unsigned long)rx_delta,
                                 twai_status.state);
                        last_fail_log_ms = now_ms;
                    }

                    last_tx_err = twai_status.tx_error_counter;
                    last_rx_err = twai_status.rx_error_counter;
                }
                // Reduce log spam - only log occasionally
                static uint32_t fail_count = 0;
                fail_count++;
                if (fail_count <= 5 || (fail_count % 100) == 0) {
                    CAN_DEBUG_ERROR("Failed to transmit message ID=0x%08X, error=%d (count=%lu)",
                                    (unsigned)(tx_item.frame.id & AP_HAL::CANFrame::MaskExtID),
                                    result, (unsigned long)fail_count);
                }
            } else if (result == ESP_ERR_INVALID_STATE) {
                // TWAI driver in invalid state - likely no other nodes on bus or disconnection
                // Continue processing queue to prevent buildup, just can't transmit yet
                static uint32_t last_invalid_state_log_ms = 0;
                static uint32_t invalid_state_count = 0;
                static uint32_t messages_dropped = 0;
                static uint32_t last_recovery_attempt_ms = 0;
                static uint32_t recovery_backoff_ms = 100;  // Start with 100ms backoff
                uint32_t now_ms = AP_HAL::millis();
                invalid_state_count++;
                messages_dropped++;  // Count this as a dropped message

                // Diagnostic: Check actual TWAI state when we get invalid state error
                twai_status_info_t diagnostic_status;
                bool got_status = (twai_get_status_info(&diagnostic_status) == ESP_OK);

                if (got_status) {
                    // Use rate-limited logging for bus state
                    BusState current_state;
                    switch (diagnostic_status.state) {
                        case TWAI_STATE_STOPPED:    current_state = BusState::STOPPED; break;
                        case TWAI_STATE_RUNNING:    current_state = BusState::GOOD; break;
                        case TWAI_STATE_BUS_OFF:    current_state = BusState::BUS_OFF; break;
                        case TWAI_STATE_RECOVERING: current_state = BusState::RECOVERING; break;
                        default:                    current_state = BusState::STOPPED; break;
                    }
                    iface->log_bus_state(current_state);

                    // Additional diagnostic info on first occurrence or occasionally
                    if (invalid_state_count == 1 || (invalid_state_count % 100) == 0) {
                        const char* state_str = "UNKNOWN";
                        switch (diagnostic_status.state) {
                            case TWAI_STATE_STOPPED: state_str = "STOPPED"; break;
                            case TWAI_STATE_RUNNING: state_str = "RUNNING"; break;
                            case TWAI_STATE_BUS_OFF: state_str = "BUS_OFF"; break;
                            case TWAI_STATE_RECOVERING: state_str = "RECOVERING"; break;
                        }
                        CAN_DEBUG_VERBOSE("TX state diagnostics: state=%s, tx_err=%u, rx_err=%u, to_tx=%lu, to_rx=%lu",
                                       state_str,
                                       (unsigned)diagnostic_status.tx_error_counter,
                                       (unsigned)diagnostic_status.rx_error_counter,
                                       (unsigned long)diagnostic_status.msgs_to_tx,
                                       (unsigned long)diagnostic_status.msgs_to_rx);
                    }
                }

                // Track recovery attempts for escalation
                static uint32_t consecutive_failures = 0;

                // Check for restart with exponential backoff to avoid hammering the bus
                bool should_attempt_recovery = false;
                if (now_ms - last_recovery_attempt_ms >= recovery_backoff_ms) {
                    should_attempt_recovery = true;
                    last_recovery_attempt_ms = now_ms;
                    consecutive_failures++;

                    // Exponential backoff: double the delay each time, max 5 seconds
                    recovery_backoff_ms = MIN(recovery_backoff_ms * 2, 5000);
                }

                if (should_attempt_recovery) {
                    iface->update_error_stats(0x08); // Invalid state error

                    // After 10 consecutive failures, escalate to full driver restart
                    if (consecutive_failures > 10) {
                        CAN_DEBUG_ERROR("TWAI recovery failed %lu times, attempting full driver restart",
                                       (unsigned long)consecutive_failures);
                        iface->attempt_driver_restart();
                        consecutive_failures = 0;
                        recovery_backoff_ms = 100;  // Reset backoff after full restart
                    } else if (got_status) {
                        // Try recovery based on current state
                        if (diagnostic_status.state == TWAI_STATE_STOPPED) {
                            // Before restarting, initiate recovery to clear error counters
                            // CRITICAL: TWAI may still have TX_ERR=128 from previous failure
                            CAN_DEBUG_INFO("TWAI is STOPPED, initiating recovery to clear error counters");
                            twai_initiate_recovery();

                            // Brief delay to let recovery process
                            hal.scheduler->delay_microseconds(10000); // 10ms

                            // Now try to start the bus
                            CAN_DEBUG_INFO("Starting TWAI after recovery (attempt %lu, backoff=%lums)",
                                          (unsigned long)consecutive_failures,
                                          (unsigned long)recovery_backoff_ms);
                            esp_err_t start_res = twai_start();
                            if (start_res != ESP_OK) {
                                CAN_DEBUG_ERROR("Failed to restart TWAI: %d", start_res);
                            } else {
                                // Verify error counters are cleared after restart
                                twai_status_info_t verify_status;
                                if (twai_get_status_info(&verify_status) == ESP_OK) {
                                    ESP_LOGI("CAN", "TWAI restarted: state=%d, TX_ERR=%u, RX_ERR=%u",
                                            verify_status.state,
                                            verify_status.tx_error_counter,
                                            verify_status.rx_error_counter);
                                    if (verify_status.tx_error_counter > 0 || verify_status.rx_error_counter > 0) {
                                        ESP_LOGW("CAN", "WARNING: Error counters not cleared after restart!");
                                    }
                                }

                                // After successful recovery, add delay before processing queued messages
                                // This gives other nodes time to stabilize and prevents flooding the bus
                                ESP_LOGI("CAN", "Delaying 200ms before processing queued messages (recovery grace period)");
                                hal.scheduler->delay(200); // 200ms recovery grace period

                                // Also consider clearing the TX queue to prevent sending stale messages
                                if (iface->tx_queue) {
                                    uint32_t queued_msgs = uxQueueMessagesWaiting(iface->tx_queue);
                                    if (queued_msgs > 10) {
                                        ESP_LOGW("CAN", "Clearing %lu stale messages from TX queue after recovery",
                                                (unsigned long)queued_msgs);
                                        xQueueReset(iface->tx_queue);
                                    }
                                }
                            }
                        } else if (diagnostic_status.state == TWAI_STATE_BUS_OFF) {
                            // Need recovery - but let it recover naturally first
                            CAN_DEBUG_INFO("TWAI is BUS_OFF, waiting for auto-recovery (attempt %lu)",
                                          (unsigned long)consecutive_failures);
                            // Don't call twai_initiate_recovery() immediately - let TWAI handle it
                            // Only force recovery after multiple attempts
                            if (consecutive_failures > 3) {
                                twai_initiate_recovery();
                            }
                        } else if (diagnostic_status.state == TWAI_STATE_RECOVERING) {
                            // Already recovering, just wait
                            CAN_DEBUG_INFO("TWAI is RECOVERING, waiting...");
                        } else if (diagnostic_status.state == TWAI_STATE_RUNNING) {
                            // Success! Reset everything
                            CAN_DEBUG_INFO("TWAI recovered to RUNNING state");
                            consecutive_failures = 0;
                            recovery_backoff_ms = 100;
                        }
                    } else {
                        // Couldn't get status, try full restart
                        CAN_DEBUG_ERROR("Can't get TWAI status, attempting full restart");
                        iface->attempt_driver_restart();
                        consecutive_failures = 0;
                        recovery_backoff_ms = 100;
                    }
                    invalid_state_count = 0;  // Reset counter after action
                }

