Bwooce/ardupilot/libraries/AP_HAL_ESP32/CANIface.cpp
    return true;
}

void CANIface::collect_hw_stats()
{
    if (!initialized) {
        stats.current_health = 2; // ERROR - not initialized
        return;
    }

    // Periodic stats disabled - available via MAVLink instead
#if 0
    static uint32_t last_stats_print_ms = 0;
    uint32_t now_ms = AP_HAL::millis();

    // Print periodic stats every 10 seconds if there's any activity
    if (now_ms - last_stats_print_ms > 10000) {
        if (stats.tx_success > 0 || stats.rx_received > 0) {
            CAN_DEBUG_INFO("CAN%d Stats: TX_OK=%u TX_FAIL=%u RX=%u Errors=%u Health=%d",
                          instance, (unsigned)stats.tx_success, (unsigned)stats.tx_failed,
                          (unsigned)stats.rx_received, (unsigned)stats.bus_errors, stats.current_health);
        }
        last_stats_print_ms = now_ms;
    }
#endif
    
    // Collect ESP-IDF TWAI hardware statistics
    twai_status_info_t twai_status;
    if (twai_get_status_info(&twai_status) == ESP_OK) {
        // Update bus error statistics from TWAI hardware
        stats.bus_errors = twai_status.bus_error_count;

        // Map TWAI state to BusState and use rate-limited logging
        BusState current_state;
        switch (twai_status.state) {
            case TWAI_STATE_BUS_OFF:
                current_state = BusState::BUS_OFF;
                stats.bus_off_count++;
                stats.current_health = 2; // ERROR
                stats.last_error_code = 0x01; // Bus-off error code
                stats.last_error_time_us = AP_HAL::micros64();
                break;
            case TWAI_STATE_STOPPED:
                current_state = BusState::STOPPED;
                stats.current_health = 1; // WARNING
                break;
            case TWAI_STATE_RECOVERING:
                current_state = BusState::RECOVERING;
                stats.current_health = 1; // WARNING
                break;
            case TWAI_STATE_RUNNING:
                current_state = BusState::GOOD;
                stats.current_health = calculate_bus_health();
                break;
            default:
                current_state = BusState::STOPPED;
                stats.current_health = 1; // WARNING for other states
                break;
        }
        log_bus_state(current_state);
        
        // Update filter rejection count if available
        // Note: TWAI hardware doesn't directly report filter rejections,
        // but we can infer from receive buffer status
        if (twai_status.msgs_to_rx == 0) {
            // No messages pending - could indicate filtering or no traffic
        }
        
    } else {
        // Failed to get TWAI status - mark as error
        stats.current_health = 2;
        stats.bus_errors++;
        stats.last_error_code = 0xFF; // Status read error
        stats.last_error_time_us = AP_HAL::micros64();
    }
}

void CANIface::update_status()
{
    if (!initialized) {
        return;
    }
    
    // Perform enhanced health check
    check_bus_health();
    
    // Send periodic MAVLink status
    send_uavcan_node_status();
}

void CANIface::check_bus_health()
{
    if (!initialized) {
        return;
    }
    
    twai_status_info_t twai_status;
    if (twai_get_status_info(&twai_status) != ESP_OK) {
        CAN_DEBUG_ERROR("Failed to get TWAI status");
        update_error_stats(0xFF); // Status read error
        return;
    }
    
    // Check for bus-off condition and attempt recovery
    static uint32_t last_recovery_attempt_ms = 0;
    static uint32_t consecutive_bus_off_count = 0;
    static uint32_t last_full_restart_ms = 0;
    uint32_t now_ms = AP_HAL::millis();
    
    if (twai_status.state == TWAI_STATE_BUS_OFF) {
        // Use rate-limited logging for BUS_OFF state
        log_bus_state(BusState::BUS_OFF);
        update_error_stats(0x01); // Bus-off error

        // Attempt basic recovery every 5 seconds
        if (now_ms - last_recovery_attempt_ms > 5000) {
            consecutive_bus_off_count++;
            ESP_LOGI("CAN", "Attempting bus recovery (attempt #%u): TX_ERR=%u, RX_ERR=%u",
                    (unsigned)consecutive_bus_off_count,
                    twai_status.tx_error_counter, twai_status.rx_error_counter);

            // If we've had persistent bus-off conditions, try full driver restart
            if (consecutive_bus_off_count > 5 && (now_ms - last_full_restart_ms > 30000)) {
                CAN_DEBUG_ERROR("Persistent bus-off condition, attempting full TWAI restart");
                
                // Store current configuration for restart
                uint32_t saved_bitrate = current_bitrate;
                
                // Perform full TWAI restart
                twai_stop();
                twai_driver_uninstall();
                
                // Brief delay to allow hardware to settle
                hal.scheduler->delay_microseconds(1000);
                
                // Reinitialize with same configuration
                if (init(saved_bitrate)) {
                    CAN_DEBUG_INFO("Full TWAI restart successful");
                    consecutive_bus_off_count = 0; // Reset counter on successful restart
                    last_full_restart_ms = now_ms;
                } else {
                    CAN_DEBUG_ERROR("Full TWAI restart failed");
                    // Continue with basic recovery attempts
                }
            } else {
                // Standard recovery attempt
                twai_initiate_recovery();
            }
            
            last_recovery_attempt_ms = now_ms;
        }
    } else {
        // Bus is healthy, reset consecutive bus-off counter
        consecutive_bus_off_count = 0;
    }
    
    // Check for excessive TX queue backlog
    if (tx_queue && uxQueueMessagesWaiting(tx_queue) > 100) {
        CAN_DEBUG_WARN("TX queue backlog detected (%u messages)", 
                           (unsigned)uxQueueMessagesWaiting(tx_queue));
        update_error_stats(0x10); // Queue backlog error
    }
    
