Bwooce/ardupilot/libraries/AP_HAL_ESP32/CANIface.cpp
    // Check for RX overruns
    if (twai_status.rx_missed_count > 0) {
        static uint32_t last_rx_missed = 0;
        if (twai_status.rx_missed_count > last_rx_missed) {
            CAN_DEBUG_WARN("RX overrun detected (missed %u messages)", 
                               (unsigned)(twai_status.rx_missed_count - last_rx_missed));
            update_error_stats(0x20); // RX overrun error
        }
        last_rx_missed = twai_status.rx_missed_count;
    }
}

void CANIface::log_bus_state(BusState new_state)
{
    uint32_t now_ms = AP_HAL::millis();

    // Detect state transitions
    if (new_state != last_bus_state) {
        // State changed - log the transition with power failure diagnostics
        if (new_state == BusState::GOOD) {
            // Recovery - calculate downtime
            if (bus_state_change_ms > 0) {
                float downtime_sec = (now_ms - bus_state_change_ms) / 1000.0f;
                ESP_LOGE("CAN", "Bus recovered to GOOD after %.2f seconds", downtime_sec);
            } else {
                ESP_LOGI("CAN", "Bus initialized to GOOD state");
            }
        } else if (new_state == BusState::BUS_OFF) {
            // Get error counters to diagnose why we went BUS_OFF
            twai_status_info_t status;
            if (twai_get_status_info(&status) == ESP_OK) {
                ESP_LOGE("CAN", "Bus entered BUS_OFF: TX_ERR=%u, RX_ERR=%u, msgs_pending: TX=%lu RX=%lu",
                         status.tx_error_counter, status.rx_error_counter,
                         (unsigned long)status.msgs_to_tx, (unsigned long)status.msgs_to_rx);
            } else {
                ESP_LOGE("CAN", "Bus entered BUS_OFF state");
            }
        } else if (new_state == BusState::STOPPED) {
            ESP_LOGE("CAN", "Bus entered STOPPED state");
        } else if (new_state == BusState::RECOVERING) {
            ESP_LOGE("CAN", "Bus entered RECOVERING state");
        }

        // Update tracking variables
        last_bus_state = new_state;
        bus_state_change_ms = now_ms;
        last_bus_error_log_ms = now_ms;
    } else if (new_state != BusState::GOOD) {
        // Still in error state - check if we should log periodic update
        if (now_ms - last_bus_error_log_ms >= 30000) {  // 30 seconds
            float downtime_sec = (now_ms - bus_state_change_ms) / 1000.0f;
            const char* state_str = "UNKNOWN";
            switch (new_state) {
                case BusState::BUS_OFF:     state_str = "BUS_OFF"; break;
                case BusState::STOPPED:     state_str = "STOPPED"; break;
                case BusState::RECOVERING:  state_str = "RECOVERING"; break;
                default: break;
            }
            ESP_LOGE("CAN", "Bus still %s - down for %.2f seconds", state_str, downtime_sec);
            last_bus_error_log_ms = now_ms;
        }
    }
    // If state is GOOD and was already GOOD, no logging needed
}

void CANIface::attempt_driver_restart()
{
    static uint32_t last_restart_ms = 0;
    static uint32_t restart_count = 0;
    uint32_t now_ms = AP_HAL::millis();

    // Rate limit restarts to prevent restart loops
    if (now_ms - last_restart_ms < 5000) {  // Minimum 5 seconds between restarts (reduced from 30s)
        // Only log periodically to avoid spam
        static uint32_t last_log_ms = 0;
        if (now_ms - last_log_ms > 2000) {  // Log at most every 2 seconds
            CAN_DEBUG_INFO("Driver restart rate-limited (last restart %lu ms ago)", (unsigned long)(now_ms - last_restart_ms));
            last_log_ms = now_ms;
        }
        return;
    }

    // Prevent multiple simultaneous restart attempts
    if (restart_in_progress) {
        CAN_DEBUG_INFO("Driver restart already in progress, skipping");
        return;
    }
    
    restart_count++;
    last_restart_ms = now_ms;
    
    // Only log restart attempts periodically to reduce spam
    if (restart_count <= 3 || (restart_count % 10) == 0) {
        CAN_DEBUG_ERROR("TWAI driver restart #%lu (invalid state)", (unsigned long)restart_count);
    }
    
    // Store current configuration
    uint32_t saved_bitrate = current_bitrate;
    
    // Stop and uninstall driver (may fail if in invalid state, but continue anyway)
    // Set a flag to signal RX/TX tasks to pause during restart
    restart_in_progress = true;

    // Give RX/TX tasks time to see the flag and exit any blocking calls
    // The RX timeout is 100ms, so wait at least that long
    // Feed watchdog during this delay
    hal.scheduler->delay(200); // 200ms to ensure RX task sees timeout and checks flag, with watchdog feeding

    // Now attempt to stop TWAI - use non-blocking approach
    esp_err_t result = ESP_OK;

    // Check current state first
    twai_status_info_t status;
    if (twai_get_status_info(&status) == ESP_OK) {
        CAN_DEBUG_INFO("TWAI state before stop: %d, msgs_to_tx: %lu, msgs_to_rx: %lu",
                       status.state, (unsigned long)status.msgs_to_tx, (unsigned long)status.msgs_to_rx);

        // Only try to stop if not already stopped
        if (status.state != TWAI_STATE_STOPPED) {
            result = twai_stop();
            if (result != ESP_OK && result != ESP_ERR_INVALID_STATE) {
                CAN_DEBUG_WARN("TWAI stop failed (error %d), forcing uninstall", result);
            }
            // Give driver time to fully stop
            hal.scheduler->delay(50); // Allow TWAI to fully stop
        }
    }

    // Always try to uninstall, even if stop failed
    result = twai_driver_uninstall();
    if (result != ESP_OK) {
        CAN_DEBUG_WARN("TWAI uninstall failed (error %d), continuing anyway", result);
    }

    // Brief delay to let hardware settle
    hal.scheduler->delay(10); // 10ms with watchdog feeding
    
    // Clear queues (they should be empty after stop/uninstall, but be safe)
    if (rx_queue) {
        xQueueReset(rx_queue);
    }
    if (tx_queue) {
        xQueueReset(tx_queue);
    }
    
    // Reinitialize with saved configuration
    initialized = false;
    bool reinit_ok = init(saved_bitrate);

    if (reinit_ok) {
        // Give TWAI driver time to fully stabilize before allowing tasks to resume
        hal.scheduler->delay(50); // 50ms for TWAI to stabilize, with watchdog feeding

        // Now clear the restart flag to allow tasks to resume
        restart_in_progress = false;

        CAN_DEBUG_INFO("TWAI driver restart successful after %lu restarts", (unsigned long)restart_count);
        update_error_stats(0x00); // Clear error state
    } else {
        // Clear flag even on failure to prevent permanent task blocking
        restart_in_progress = false;

        CAN_DEBUG_ERROR("TWAI driver restart failed - interface may be unusable");
    }
}

#endif // HAL_NUM_CAN_IFACES > 0
